<?php

function chinese_name($gender=-1, $prob=0.05, $total=1) {
   // 決定性別 (若未傳入，則隨機產生)
   $gender = ( ($gender==0) || ($gender==1) ) ? $gender : mt_rand(0,1);
   
   // 決定複姓的發生機率
   $prob = ($prob>=0.0 && $prob<=1.0) ? $prob : 0.0;
   
   // 決定數量
   $total = ($total>=1) ? $total : 1;
   
   // 定義『姓』
   $a_last = array(
     "陳 ", "陳 ", "陳 ", "陳 ", "陳 ", "陳 ", "陳 ", "陳 ", "陳 ", "陳 ", "陳 ",
     "林 ", "林 ", "林 ", "林 ", "林 ", "林 ", "林 ", "林 ",
     "黃 ", "黃 ", "黃 ", "黃 ", "黃 ", "黃 ",
     "李 ", "李 ", "李 ", "李 ", "李 ",      
     "張 ", "張 ", "張 ", "張 ", "張 ",      
     "王 ", "王 ", "王 ", "王 ",              
     "吳 ", "吳 ", "吳 ", "吳 ",              
     "劉 ", "劉 ", "劉 ",                      
     "蔡 ", "蔡 ", "蔡 ",                      
     "楊 ", "楊 ",
     "趙 ", "錢 ", "孫 ", "李 ", "周 ", "吳 ", "鄭 ", "王 ", "馮 ", "陳 ", "褚 ", "衛 ",
     "蔣 ", "沈 ", "韓 ", "楊 ", "朱 ", "秦 ", "尤 ", "許 ", "何 ", "呂 ", "施 ", "張 ",
     "孔 ", "曹 ", "嚴 ", "金 ", "魏 ", "陶 ", "謝 ", "鄒 ", "章 ", "蘇 ", "潘 ", "葛 ",
     "彭 ", "韋 ", "馬 ", "苗 ", "花 ", "方 ", "俞 ", "任 ", "袁 ", "柳 ", "鮑 ", "史 ",
     "唐 ", "費 ", "薛 ", "雷 ", "倪 ", "湯 ", "羅 ", "郝 ", "皮 ", "伍 ", "顧 ", "孟 ",
     "黃 ", "蕭 ", "姚 ", "邵 ", "汪 ", "毛 ", "宋 ", "熊 ", "紀 ", "祝 ", "董 ", "梁 ",
     "杜 ", "阮 ", "賈 ", "江 ", "顏 ", "郭 ", "林 ", "鍾 ", "徐 ", "邱 ", "高 ", "夏 ",
     "蔡 ", "田 ", "胡 ", "柯 ", "盧 ", "丁 ", "鄧 ", "洪 ", "包 ", "崔 ", "程 ", "裴 ",
     "陸 ", "荀 ", "劉 ", "詹 ", "葉 ", "白 ", "賴 ", "卓 ", "譚 ", "牛 ", "溫 ", "莊 ",
     "廖 ", "簡 ", "曾 " );
   

    // 定義『複姓』
   $a_last2 = array("司馬 ", "上官 ", "歐陽 ", "諸葛 ", "東方 ", "皇甫 ", "公孫 ",
                    "令狐 ", "慕容 ",  "范姜 " );
   
   
   // 定義『女生名字的字』
   $a_firstf = array(
     "女 ", "凡 ", "千 ", "之 ", "元 ", "巧 ", "仙 ", "妃 ", "汝 ", "羽 ", "伊 ", "希 ",
     "妙 ", "君 ", "秀 ", "杏 ", "岑 ", "沛 ", "妍 ", "吟 ", "伶 ", "幸 ", "花 ", "怡 ",
     "佩 ", "宛 ", "芹 ", "芷 ", "宓 ", "枝 ", "采 ", "亞 ", "芸 ", "芙 ", "芝 ", "妲 ",
     "芳 ", "佳 ", "季 ", "依 ", "岱 ", "洋 ", "盈 ", "秋 ", "姝 ", "珊 ", "紅 ", "柔 ",
     "屏 ", "娃 ", "美 ", "貞 ", "春 ", "若 ", "珍 ", "香 ", "思 ", "郁 ", "昭 ", "玲 ",
     "姚 ", "娉 ", "桃 ", "姬 ", "峨 ", "茱 ", "紗 ", "純 ", "庭 ", "容 ", "茹 ", "珠 ",
     "娥 ", "茜 ", "倩 ", "真 ", "悅 ", "卿 ", "娣 ", "婕 ", "荳 ", "彩 ", "雪 ", "情 ",
     "曼 ", "荷 ", "淇 ", "雀 ", "梅 ", "逸 ", "琴 ", "惠 ", "萍 ", "雲 ", "喬 ", "菱 ",
     "雁 ", "晴 ", "湘 ", "雅 ", "筑 ", "詠 ", "琪 ", "琳 ", "慈 ", "虞 ", "蛾 ", "詩 ",
     "葵 ", "煙 ", "愛 ", "群 ", "鈴 ", "瑞 ", "楓 ", "瑤 ", "圓 ", "綺 ", "鳳 ", "銀 ",
     "熙 ", "嫦 ", "綿 ", "舞 ", "甄 ", "碧 ", "寧 ", "蔓 ", "潔 ", "蝶 ", "慧 ", "嬋 ",
     "嬌 ", "襄 ", "黛 ", "曉 ", "憶 ", "鵑 ", "瓊 ", "麗 ", "嬿 ", "瀚 ", "鏡 ", "鵬 ",
     "麒 ", "櫻 ", "鶯 ", "靈 ", "鸞 ", "芬 ", "淑 ", "蓉 " );
   
   // 定義『男生名字的字』
   $a_firstm = array(
     "一 ", "乙 ", "丁 ", "人 ", "大 ", "才 ", "上 ", "工 ", "士 ", "川 ", "力 ", "子 ",
     "于 ", "山 ", "友 ", "文 ", "夫 ", "公 ", "王 ", "天 ", "介 ", "仁 ", "方 ", "木 ",
     "中 ", "月 ", "心 ", "甘 ", "仕 ", "世 ", "玉 ", "民 ", "弘 ", "正 ", "巨 ", "冬 ",
     "石 ", "生 ", "同 ", "宇 ", "仲 ", "成 ", "吉 ", "百 ", "江 ", "合 ", "池 ", "冶 ",
     "志 ", "邦 ", "材 ", "孝 ", "辛 ", "見 ", "男 ", "貝 ", "廷 ", "伯 ", "里 ", "利 ",
     "言 ", "彤 ", "良 ", "谷 ", "忠 ", "昆 ", "岳 ", "坤 ", "京 ", "昌 ", "朋 ", "岡 ",
     "宜 ", "炎 ", "叔 ", "松 ", "金 ", "武 ", "易 ", "牧 ", "和 ", "青 ", "雨 ", "奇 ",
     "東 ", "法 ", "宗 ", "明 ", "柱 ", "亭 ", "柏 ", "城 ", "泉 ", "飛 ", "虹 ", "彥 ",
     "亮 ", "重 ", "施 ", "星 ", "宣 ", "政 ", "革 ", "映 ", "津 ", "俊 ", "相 ", "茂 ",
     "范 ", "俠 ", "韋 ", "扁 ", "郎 ", "段 ", "洛 ", "胡 ", "侯 ", "度 ", "音 ", "南 ",
     "科 ", "律 ", "約 ", "威 ", "英 ", "建 ", "柳 ", "洲 ", "致 ", "軍 ", "冠 ", "炳 ",
     "計 ", "信 ", "洪 ", "風 ", "帝 ", "浩 ", "荀 ", "書 ", "修 ", "格 ", "海 ", "陣 ",
     "軒 ", "宵 ", "馬 ", "冢 ", "茗 ", "剛 ", "草 ", "唐 ", "峻 ", "振 ", "高 ", "倫 ",
     "朗 ", "泰 ", "展 ", "原 ", "家 ", "堅 ", "章 ", "莊 ", "望 ", "貫 ", "崧 ", "堂 ",
     "莫 ", "通 ", "捷 ", "康 ", "國 ", "彬 ", "啟 ", "盛 ", "陶 ", "健 ", "強 ", "清 ",
     "淳 ", "勝 ", "貴 ", "景 ", "隆 ", "朝 ", "尊 ", "棠 ", "敦 ", "喜 ", "華 ", "皓 ",
     "陽 ", "順 ", "雄 ", "富 ", "翔 ", "傳 ", "雷 ", "義 ", "蜂 ", "盟 ", "達 ", "敬 ",
     "稚 ", "道 ", "溫 ", "新 ", "意 ", "萬 ", "楚 ", "照 ", "運 ", "聖 ", "維 ", "碩 ",
     "嘉 ", "漢 ", "熊 ", "綸 ", "齊 ", "福 ", "綠 ", "鳴 ", "境 ", "銘 ", "榮 ", "德 ",
     "鋒 ", "融 ", "翰 ", "興 ", "龍 ", "豐 ", "衛 ", "錦 ", "樹 ", "學 ", "嚴 ", "寶 ",
     "羅 ", "識 ", "釋 ", "鐘 ", "譽 ", "躍 ", "麟 ", "觀 ", "驥 " );

   // 開始產生
   $a_ret = array();
   for($i=1; $i<=$total; $i++) {
      // 依比例出現單姓或複姓
      $rr = mt_rand() / mt_getrandmax();
      if($rr<=$prob) {
        $n1 = $a_last2[array_rand($a_last2,1)];  // 複姓
      }
      else {
         $n1 = $a_last[array_rand($a_last,1)];
      }
      
      // 依性別決定男生名或女生名
      if($gender==0) {
         $n2 = $a_firstf[array_rand($a_firstf)];
         $n3 = $a_firstf[array_rand($a_firstf)];
      }
      else {
         $n2 = $a_firstm[array_rand($a_firstf)];
         $n3 = $a_firstm[array_rand($a_firstf)];
      }
      
      $fullname = trim($n1) . trim($n2) . trim($n3);
      $a_ret[] = $fullname;
   }

   // 若只有一個數量，則傳回變數；若有多個，則傳回陣列
   $ret_val = (count($a_ret)==1) ? $a_ret[0] : $a_ret;
   return $ret_val;
}

?>